Catalogs/СервисСверкиРасчетовНастройкиОповещенийПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СервисСверкиРасчетовНастройкиОповещенийПользователей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещатьОРасхождениях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборОрганизаций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещатьОРасхожденииСумм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещатьОРасхожденииПервичныхДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещатьОРасхожденииСчетовФактур</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоГлобальнаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборКонтрагентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейБезДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПользователей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещатьОбУстраненииРасхождений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СервисСверкиРасчетовНастройкиОповещенийПользователей/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДубльНастроек = ДубльНастроек();
	Если ЗначениеЗаполнено(ДубльНастроек) Тогда
		ЗаписьЖурналаРегистрации(СервисСверкиРасчетов.ИмяСервиса(),
			УровеньЖурналаРегистрации.Ошибка, Метаданные(), Ссылка,
			НСтр("ru = 'Для пользователя уже существует настройка оповещений';
				|en = 'A notification setting already exists for the user'"));
		ВызватьИсключение НСтр("ru = 'Для пользователя уже существует настройка оповещений';
								|en = 'A notification setting already exists for the user'");
	КонецЕсли;
	
	Если Организации.Количество() = 0 И ОтборОрганизаций <> 0 Тогда
		ОтборОрганизаций = 0;
	КонецЕсли;
	
	Если Пользователи.Количество() = 0 И ОтборПользователей <> 0 Тогда
		ОтборПользователей = 0;
	КонецЕсли;
	
	Если Контрагенты.Количество() = 0 И ОтборКонтрагентов <> 0 Тогда
		ОтборКонтрагентов = 0;
	КонецЕсли;
	
КонецПроцедуры

Функция ДубльНастроек()
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Настройка", Ссылка);
	Запрос.Параметры.Вставить("Пользователь", Пользователь);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	СервисСверкиРасчетовНастройкиОповещенийПользователей.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СервисСверкиРасчетовНастройкиОповещенийПользователей КАК СервисСверкиРасчетовНастройкиОповещенийПользователей
	|ГДЕ
	|	СервисСверкиРасчетовНастройкиОповещенийПользователей.Пользователь = &Пользователь
	|	И СервисСверкиРасчетовНастройкиОповещенийПользователей.Ссылка <> &Настройка
	|	И СервисСверкиРасчетовНастройкиОповещенийПользователей.ПометкаУдаления = ЛОЖЬ";
	ДублиНастроек = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат ДублиНастроек;
	
КонецФункции

#КонецЕсли
